app/controllers/authentication_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'anil@gmail.com' LIMIT 1
---
    def login
        begin
            @user = User.find_by_email!(params[:email])