app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if user_params[:password] == user_params[:password_confirmation]
            if @user.save
---
INSERT INTO `users` (`name`, `user_name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('anil1', 'anil1', 'anil1@gmail.com', '$2a$12$qcklG8pvu2EBfq.fZVVwC.e3SBaPmHSix1/jDYZ1ZOSiDZTDNUrja', '2023-01-29 16:30:50.904184', '2023-01-29 16:30:50.904184')

    def find_user
        begin
            # @user = User.find_by_username!(params[:user_name])
            @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1